/** @format */

const Intro = [
  "嘿！旅行者啊，好像以前在這附近沒看過妳",
  "妳應該是來自不同的地方吧？妳長得跟我們有些不一樣",
  "一臉壽星樣的",
  "我是一介用像素構成的農夫，歡迎妳來到我的農場",
  "既然我們會相遇一定也是我的創造者的安排，我有一事相求",
  "是這樣的...",
  "看到後面這片草原了嗎？",
  "我的像素鴨鴨們因為網路爆ping，所以通通從穀倉跑出來了",
  "妳的能力應該有辦法幫我把他們通通抓回穀倉裡吧",
  "當然，我也不會讓妳做白工",
  "穀倉代表著不同的願望",
  "分別為財運、健康、感情、事業",
  "只要把像素鴨鴨們丟到妳想要的穀倉",
  "穀倉裡的鴨鴨就會在未來一年報答妳",
  "如何？這份交易不錯吧",
  "妳願意幫幫我嗎？",
  "抱歉我忘記帶到拒絕的按鈕了",
  "那麼我們就開始吧！",
]

const Outro = [
  "哇喔！看來像素鴨鴨們都回到他們穀倉裡了",
  "真的非常感謝",
  "這樣我就可以安穩的度過這一年了",
  "希望妳在三九年華（？）的這年也是呢",
  "好了，看來妳我相處的時間到了",
  "我們來看看妳許了哪些願望吧，該幹活了鴨鴨們",
]

const Normal = {
  感情: "鴨鴨去找月老歡家",
  財運: "鴨鴨去找人資談加薪",
  健康: "鴨鴨給妳一根幸運健康羽毛",
  事業: "鴨鴨給妳押風水加班不再來",
}

const Specific = {
  感情: "去找月老歡家，然後物色一個對象送到妳面前，<br/>在認真生活的時候也可以留意一下週遭的人！",
  財運: "去找人資給妳談加薪，<br/>再去彩券行要裡面有2000萬的那本給妳呱，記得中了分我們一點！",
  健康: "搜集一百根幸運健康羽毛，再祝妳永遠都不要再嘴破，<br/>千秋萬世不失眠！",
  事業: "給妳押風水，妳跟同事都超給力，加班從此變傳說",
}

export { Intro, Outro, Normal, Specific }
