/** @format */

const Intro = [
  // "嘿！旅行者啊，好像以前在這附近沒看過你",
  // "你應該是來自不同的地方吧？你長得跟我們有些不樣",
  // "一臉壽星樣的",
  // "我是一介用像素構成的農夫，歡迎你來到我的農場",
  // "既然我們會相遇一定也是我的創造者的安排，我有一事相求",
  // "是這樣的...",
  // "看到後面這片草原了嗎？",
  // "我的像素鴨鴨們因為網路太慢，所以通通都從穀倉跑出來了",
  // "你的能力應該有辦法幫我把他們通通抓回穀倉裡吧",
  // "當然，我也不會讓你做白工",
  // "穀倉代表著不同的願望",
  // "分別為財運、健康、感情、事業",
  // "只要把像素鴨鴨們丟到你想要的穀倉",
  // "穀倉裡的鴨鴨就會在未來一年用wifi光波幫助你",
  // "如何？這份交易不錯吧",
  // "你願意幫幫我嗎？",
  // "抱歉我忘記帶到拒絕的按鈕了",
  "那麼我們就開始吧！",
]

const Outro = [
  // "哇喔！看來像素鴨鴨們都回到他們穀倉裡了",
  // "真的非常感謝",
  // "這樣我就可以安穩的度過這一年了",
  // "希望妳在三九年華（？）的這年也是呢",
  // "對了，我的創造者好像留了一些話要我帶給妳",
  // "好了，看來妳我相處的時間到了",
  "我們來看看妳許了哪些願望吧，該幹活了鴨鴨們",
]

const Normal = {}

const Specific = {}

export { Intro, Outro, Normal, Specific }
